// blog.js
//テキストは<div class="text-wrapper">で囲む
//画像はそのままimgタグで良い。<div class="text-wrapper">からは外す
//埋め込み映像は<div class="blog-video-wrapper">で囲む
//一番最後に<br>で行の追加を忘れない
//aタグー<a href="https://otasora.website" target="_blank">　</a>
const blogContents = [
      {
    pagetitle: "blog-260116",
    title: "coolsitesについて",
    date: "2026/01/16",
    category: "about coolsites",
    content: `
     
     <a href="https://docs.google.com/spreadsheets/d/10ZJ9bJ5F4-DTiFKvOSk1olLY0ak6LCjYapp4uXynpjY/edit?usp=sharing" target="_blank"><img src="blog/coolsites/1_1000_1.png" /></a>
     <div class="text-wrapper"> 
     <p><a href="https://docs.google.com/spreadsheets/d/10ZJ9bJ5F4-DTiFKvOSk1olLY0ak6LCjYapp4uXynpjY/edit?usp=sharing" target="_blank">coolsites↗︎</a></p>
     <p>
     <a href="https://detail.chiebukuro.yahoo.co.jp/qa/question_detail/q13270758388" target="_blank">ネットサーフィン</a>をしていて、coolなサイトを見つけたら<a href="https://business.ntt-east.co.jp/bizdrive/word/bookmark.html" target="_blank">ブックマーク</a>（以下、BM）をする。BMしたページはこのcoolsitesというタイトルの<a href="https://workspace.google.com/intl/ja/products/sheets/" target="_blank">スプレッドシート</a>のリストに追加されるようにしている。
     </p>
      <p>
     初めはGAS（<a href="https://developers.google.com/apps-script/overview?hl=ja" target="_blank">Google Apps Script</a>）を使ってみたいなと思って、<a href="https://chatgpt.com/ja-JP/overview?openaicom_referred=true" target="_blank">chatGPT</a>を頼ってBMをスプレッドシートに反映させるものを作ってみた。<br>
     ChromeでBMしたページがスプレッドシートに<a href="https://developer.mozilla.org/ja/docs/Glossary/Favicon" target="_blank">ファビコン</a>の画像・title・URL・BMした日時が自動で記載されるようにしている。基本的には自分が管理しやすくするために始めたことだけど、スプレッドシートにまとめるなら他の人にも共有しようと思って公開している。
     </p>
      <p>
     coolだと思ったwebサイトを適当にBMしているので一貫性がある訳ではないけど、まだ何かを見出すには少なすぎる。<br>
     一旦整理するために、サイトのデザイナーとデベロッパー／コーダーをネットサーフィンの範囲内で調べて掲載した。多分この人が作ったものだと思うけど、明言されてないものは書かないようにしている。勝手に載せているので、もしも載せてほしくない方がいらっしゃいましたらお教えください。<br>
     デザイナーやデベロッパー／コーダーを調べるのは面白い。当たり前だけど、規模が大きいものほどデザイナーとデベロッパー／コーダーは別の人がやっていて、個人サイトはどちらも同じ人が担当していることが多い。調べる中で関連して他のwebサイトや制作物が<a href="https://www.irasutoya.com/2013/07/blog-post_8147.html" target="_blank">芋づる式</a>に湧き出てきてリストもまた増えていってしまう。適当にBMして後から掘り下げることで自分の頭の中も整理されていくように感じる。
     </p>
      <p>
     全てのデザイナーやデベロッパー／コーダーを記載すれば良いということでもないのですが、記入できていない部分についてもしもご存じの方がいらっしゃいましたらご教授ください。会った時でも良いですし、DMや<a href="https://forms.gle/17ErUsJnvgpZaqVM9" target="_blank">formでも</a>大丈夫です。同時に間違いや削除等々ありましたらご連絡ください。<br>
     よろしくお願いいたします。<"⭐︎_⭐︎">
     </p>
     <br>
</div>
   
`
  },
     {
    pagetitle: "blog-260109",
    title: "発光！メモまとめ2025",
    date: "2026/01/09",
    category: "hakko!2025",
    content: `
     <div class="text-wrapper"> 
     <p>
     <a href="https://otasora.website/hakko/" target="_blank">発光！</a>というメモを載せるためだけのサイトを運営しています。このサイトではケータイのメモアプリに書いたメモの中から公開できるものを載せています。メモは思いついたことや買う物などを書いています。特に意味なくやっていますが、公開している方が続けられそうなので公開するためのサイトを作ってみました。
     </p>
     <p>
    去年、これまで使っていたglitchというサービスが終了してしまったため、途中から自分のwebサイトの階層に入れ直しました。glitchはいくつかwebサイトを作ったりしていたので寂しいです。最初に作ったwebサイトはglitchで作成しました。これまでサービス運営ありがとうございました。
     </p>
     <p style="margin-bottom:28px;">
    去年同様にこのサイトに掲載したメモをまとめていきたいと思います。
     前回は分類分けしてみましたが、今回は選んだメモからその時のことを思い出して、考えていたことや見返して今思ったことをつらつらと書いています。メモを見返してこんなこともあったなと朧げに思い出せるのでとても楽しいです。適当に読んでください。<br>今年は全体で171メモありました。その中から28メモについて書いていきます。
     </p>
     </div>
     <hr class="blog-hr2">
     <div class="text-wrapper"> 

     <h1>
     〰発光！メモまとめ2025〰
     </h1>
     <h2>
     ・スマドリスマドリと思ってないことずっと言ってる浜ちゃんは孤独
     </h2>
     <p class="memotext">
     最近書いた。 YouTubeの広告でよく流れるサントリーのCMで、芸人が飲み会の時にノンアルでも大丈夫みたいなことをずっと言っている。酒を作って売っている会社がこんなCMを作って社会の規範まで作ろうとしていることにすごいと思う。広告は商品に有利な社会規範を作ることなのかもと思った。
     ダウンタウンの浜田は酒を飲むことを強要してくるというイメージを逆手にとって、もう彼すら強要しない社会であるというメッセージを明示することで、この社会規範を強要している。ただ、浜ちゃんの本当のきもちは？
     </p>

     <h2>
     ・耳まで湯船に浸かって心臓が百数えるのを聴く
     </h2>
     <p class="memotext">
     身体を洗って湯船に浸かると、髪についた水滴がだんだん冷たくなって、肩・首・耳を不快にさせる。自宅の湯船では湯から上がる前に頭も湯につけるようにしている。寝そべれるほど広くはないのでなんとかして、かなり頑張って、足とかは湯船の外に放り出して耳まで浸かるようにしている。髪は重たい重力から離れて自由に浮かぶ。水の中で鼓動する心臓の音が明確に聞こえると、それをいつの間にか100まで数えている。
     </p>

     <h2>
     ・ひとりの夜に、このまま、数回折りたたまれて私の表面が月に触れる。
     シャンプーボトルに垂れた液が、凝固して体毛とからむ。ペラペラのTシャツを着ていた季節を思い出して、暑さも寒さも遠くなる。最初に月に立った宇宙飛行士の視力はあの星の発光をみるためにトレーニングされたのだ。
     </h2>
     <p class="memotext">
    見たものをいくつか繋ぎ合わせて書いた。メモなのかなんなのかわからない。
     </p>

     <h2>
     ・ライブに行った時の音がでかくて気持ちいいという感覚絶対に忘れない。
     </h2>
     <p class="memotext">
     小学生の時、体育館に太鼓の楽団が来て演奏を聴いた時のことを忘れられない。太鼓に張られてある動物の皮の大きな振動が巨大な空間の中で増幅しながら鳴り響いた。同時に身体中が震えた。比喩でなく、物理的に。その時の感動をどうしても忘れられない。ライブに行くとそれが体験できるし、その体験が最も大切だとすら思っている。
     </p>

     <h2>
     ・おばさんが悪口言う時にささやく声
     </h2>
     <p class="memotext">
     喫茶店で時間を潰している時には、隣の席のおしゃべりに耳を向けることが多い。聞かれている人たちは多分、こういうことをしない。なので、無防備になんでも話している。聞かれていないと思っている。なのに、悪口の時は小声でささやくように言う。そのささやきが一番耳に入ってくる
     </p>

     <h2>
     ・張り紙がちょうど落ちる瞬間を見た
     </h2>
     <p class="memotext">
     去年は歩く距離は減ってしまった。なぜなら通勤のための距離がなくなったから。でもよく散歩はしたと思う。いろんな街をよく歩いた。一人の時も誰かとの時もキョロキョロしながら面白いものやことがないか探してしまう。知らない街を歩くとその街にとっては普通のことでもおかしく思うことばかりだ。そうやってどこでも観光地にしていきたい。
     </p>

     <h2>
     ・散歩は同じルートだと考え事ばかりしてしまう。夏場はいいが、冬場は大抵悲しいことばかり考えてしまうのでルートを適度に変えたほうがいい。
     </h2>
     <p class="memotext">
     寒いと悲しい想像ばかりしてしまってダメだ。頭の中で将棋のように何手先も読んでしまって、打つ前に負けを宣言してしまう。しかし、それは同じことを同じように考えているだけな気がする。楽だから。どうにかこうにか違うことをするために体力が必要だ。
     </p>

     <h2>
     ・ひさびさに自転車乗った。翼だ🪽
     </h2>
     <p class="memotext">
     久々に自転車に乗ると翼みたいで、どこへでも行けそうだと勘違いする。強く踏み込めば加速するタイヤの回転が速度そのものになる。地形に影響を受けずにここが空だったらと想像する。空中だと踏み込むことは不可能で、ペダルを逆回転させる時のような空虚さがあるだけだとすぐさま現実に戻る。あのスピード感は魅力的で危険だ。
     </p>

     <h2>
     ・セミの中で間違えて鳴くスズメ
     </h2>
     <p class="memotext">
     夏は暑過ぎて蝉の声を聞かなくなった。単に家から出れてないだけか。公園の木もいつの間にか丸裸にされて蝉の留まる場所も無い。夕方ごろになるとザワザワと群れで示し合わせて鳴き始め、夏が始まる。鳥も思わず鳴いている。
     </p>

     <h2>
     ・映画より映画の予告編観てる時間の方が好きかも
     </h2>
     <p class="memotext">
     高校生くらいの時にスマホを手にしてから、YouTubeで映画の予告編ばかりみていた。大学に行ってからは興味ある映画の予告くらいしか観なくなったが、ふと適当な映画の予告編を観ていて思い出した。
当時のYouTubeはもっと知らない何かをどんどん教えてくれる感覚があった。YouTubeは田舎の私を自由にさせてくれた
     </p>

     <h2>
     ・高田渡とエルテレサ交互に聴こうよ。深夜2時
     </h2>
     <p class="memotext">
   去年はエルテレサをかなり聴いた。柴田聡子とも一緒に歌ってくれてありがとう。ライブに行ってみたいが、一人では厳しいと思う。誰か誘って行ってみたい。高田渡は話すように歌う人。話すように歌う人の歌が好きだ。
     </p>

     <h2>
     ・つらい時に食べたサラダの味を忘れない。そこにあった３つのトマトの目にしみる赤さ。木製の器の手触りのあたたかさ。まわりにいる人たちのおしゃべりの声。どれもこのサラダの味を作っている。悲しさはスパイスにはならなくて、とにかくよどんだ酸っぱさが口の中を占領する。何色ですか？口の中。自分で見れない舌の色。キラリと光った奥歯の銀歯。たくさんあってかわいいね。歯の周りにある生々しい歯茎が強く銀歯を輝かせる。
     </h2>
     <p class="memotext">
     数年前に友達とサイゼリアに行った時のことを忘れられない。あの時はひどく落ち込んでいてもうどうにもなりそうになかった。誰にも助けてもらうつもりはなくて、別にどうでもよかった。この時の目の前の風景を今でも思い出して悲しくなったり、また会いたいなと思ったりする。
     </p>

     <h2>
     ・歯を磨くのが楽しいと思うタイミングがある。
     </h2>
     <p class="memotext">
     歯ブラシの先端を通じて自分の歯や歯茎の形を撫でることで感じる。普段は触らない場所を確認しながら綺麗にしていく作業が楽しいと思う時がある。口内は歯の硬さと歯ぐきの柔らかさのコントラストが絶妙だ
     </p>

     <h2>
     ・ノーウォーノーウォー
     </h2>
     <p class="memotext">
    ノーウォーノーウォーと叫びながら金属製の鍋とお玉で騒音を立てて走り出したい。世界は戦争ばかりで、どうすることもできない。どうすることもできない。人が死んでいく。誰も死んでほしくない。
     </p>

     <h2>
    ・服の隙間の肌が露出した部分に雨がさして、乾いた針が触れたみたい。
     </h2>
     <p class="memotext">
    実際にこういうことがあったわけではなくて、なんとなく思いついて書いた。前半部分が先に思い浮かんで、雨がさしてから乾いた針を連想して繋げてみた。<br>
乾いた風が冷たくなった夜の散歩道にジャケットの袖と手袋の間とか、首筋とかの肌がどうしても空気に触れてしまう部分に冷たい風の針が、刺すのではなく触れてくるみたいな感覚があった。
     </p>

     <h2>
     ・大人数でゆっくり進むと儀式みたい
     </h2>
     <p class="memotext">
    春と夏の間くらいに新宿に行くと祭りをやっていて、大人数が車の進行を止めながら神輿をかついでゆっくりと進んでいた。警官が信号も止めていた。ゆっくりとゆっくりとタイヤの跡しかなかった道を神輿が進んでいく。みんな立ち止まって観ていた。
     </p>

     <h2>
     ・いい色の本を買う。同じ帯が2枚ついていてなぜかラッキー
     </h2>
     <p class="memotext">
     くどうれいんの「日記の練習」という本を読んだ。とにかく本のカバーの色が綺麗で何回か撫でた。触り心地も良い。作ったり考えたりしたこと全部見せるのではなくて、見せるものを選んでいくことがものを作ることなんだと思った。
     </p>

     <h2>
     ・ハンドバックみたいに飼い犬を持つ田舎のじーさん
     </h2>
     <p class="memotext">
    何かの列に並んでいる時に見た気がする。この日に別の場所でもう一回見かけたので驚いた。もしかしたら別の人かもしれないけど、多分同じ人。脇に抱えたダックスフントがハンドバックみたいに見えた。犬ももう歩くつもりはなくて、ハンドバックみたいな顔をしていた。
     </p>

     <h2>
     ・ 買い物に車でいく。窓を開けてたけのこの匂いが入ってくる。春か夏のにおい。
     </h2>
     <p class="memotext">
     買い物に車で行った。免許は持っていないので、いつまでも助手席だ。助手席に座っていつまでも歌っていたいといつも思っている。運転手は全ての窓の開閉の権利を持っていて羨ましい。好きな時に好きな窓を開けて空気を入れることができる。入ってきた空気は生の筍の匂いがして頭の中の庭の緑の草が風でなびいた
     </p>

     <h2>
     ・曽我部恵一が赤ちゃんのことをいいにおいのあたたかい生き物と言っていた。
     </h2>
     <p class="memotext">
     曽我部恵一は喋るように歌う人で好きだ。ライブに行って衝撃を受けた。歌う声も大きい！歌詞そのものも歌というよりは、話した言葉そのままを写し取ったみたいでいつもおかしい。でも、何度聞いても完璧な言葉だ。美しくて勇気をくれる。
     </p>

     <h2>
     ・ アスファルトの中のガラス、反射してキラキラ。干からびたゲロをつつく鳩たちの気楽さ。
     </h2>
     <p class="memotext">
    アスファルトの中にガラスが含まれていることを小学生の頃に知って、ずっとそのことが好きだ。特に新しくできた道は太陽の光を確実にキラキラにしてこちらに返す。美しい。澄み切った新品のアスファルトの美しさの上に落ちたゲロを鳩たちは集中してつつく。
     </p>

     <h2>
     ・ほんの少し暖かくなって、外にいても凍えなくなった夜に、公園で缶ビールを飲む。たのしい。後ろには車もバイクも、電車も行き交ってうるさい。公園には誰もいない。忘れられたマスコットのぬいぐるみがベンチに座っていたり、崩された砂の山がのけぞっていたりする。周辺の家の窓からは点々と明かりが漏れている。顔は真っ赤で見上げた空の月と目が合う。星って思っているより星の形でちゃんと星をしていてすごいと思う。夜風にあたる。指先がビールの冷たさに耐えられなくなって家に帰った。
     </h2>
     <p class="memotext">
     酔っ払って書いた。その時に見えたものを書いた。公園には気にしなければ遊具しか存在しない。この砂まみれの場所には電車のうるさい音もあるし、窓からの光も星の光もある。酔っ払うと頭の中で全部が一緒になる。全部が同じ引き出しの中でぐちゃぐちゃにこんがらがってしまう。それがいつもたのしい。
     </p>

     <h2>
     ・すれ違うヤンキーのヒゲ面が酒で赤らんでいた。無防備な
     </h2>
     <p class="memotext">
     飲み会の前、待ち合わせで待っていた時、時間を潰すために集合場所の近くをふらついていた。ヤンキーな集団がワラワラと顔を赤くしてこちらに向かってくる。赤い！と叫びそうになった。こんなに赤く無防備に飲み会をしていて羨ましいと思った。
     </p>
     
     <h2>
     ・水槽のまわり水浸し。拭いといてって言ったのに、乾いた布が机の上。コップに入った水は中途半端に残っている。ここにメダカを入れたらどれくらいで死ぬだろうか。鍛えられたアイドルのメンタル。純白でふくらんだ衣装が覆う体。間抜けなふりした悪役はグミを食べながらインターネットを観ています。すごい頻度で入る広告を15秒まつ間、どこで暮らすか考える。あなたはもう帰って来ないんでしょ。羽みたいな襟が首に擦れて春のにおい。
     </h2>
     <p class="memotext">
     これを書いた時のことは何も思い出せないし、特にそういうことがあったわけではない。羽みたいな襟の服なんて持っていないし着たことも無い。どこで暮らすかはいつも考えている。どの街にいてもお客さんみたいな感覚がなくならない。その街で何回春を過ごせばその感覚は無くなるのだろうとかも考える。
     </p>

     <h2>
     ・ 雲の上で天使と踊る。踊る。握りしめた指先から壊れていった。地面へ落ちるのが怖い。伝わったら良いのにねって。君の気持ち。天使が言った。恐竜みたいな歩き方。老婆。かつて彼女に生えていた羽毛。描けない絵のこと追いかけて、ますます訳が分からなくなる。一旦ストップ。一方通行の道に間違って入って罰金。警察の目。子供達の目。光るランドセルのカラフルさ、に驚く。もう子供は赤でも黒でもなくなっていた。
     </h2>
     <p class="memotext">
     これも書いた時のことを思い出せない。バラバラのことを繋ぎ合わせて書いたのはわかる。「一方通行の道に間違えて入って罰金」は友達のエピソードをまるまる書いている。「描けない絵のこと」はずっと追いかけていると思う。天使にも恐竜にも老婆にもかつては羽毛が生えていた。
     </p>

     <h2>
     ・食パンは5枚切りのものから無くなる
     </h2>
     <p class="memotext">
     夜にスーパーに行くと５枚切りの食パンはなくて、６か４枚切りばかり残っている。夕方に行ってもそういうことがよくある。これは日々の観察から得た知識だと思う。いつも困る。どの家も５枚切りがちょうどいいのだ。
     </p>

     <h2>
     ・山火事鎮圧のニュース。鎮圧まで長い時間がかかって、インタビューを受けた70代の女性は人生と同じくらい長かったと言っていた。
     </h2>
     <p class="memotext">
     実際に放送されたインタビューで女性が言っていた。確か広い範囲での火災だったと思う。多分そこに長く住んでいる彼女のその言葉には重さと軽さが両方あったように思う。失った気持ちとどうしようもないという諦めの気持ちが両立しているようだった。
     </p>

     <h2>
     ・昨日あったこと夢のように忘れてまう。ので、メモして忘れないようにしたい。
     </h2>
     <p class="memotext">
     本当に忘れてしまうことばかり。でもメモしていたらこんな感じで思い出せて少し立ち止まって考えることもできる。できるかぎり続けていきたい。何も取りこぼしたくない。もったいないので。
     </p>
     <br>
</div>
   
`
  },
  {
    pagetitle: "blog-250902",
    title: "このwebサイトについて",
    date: "2025/09/02",
    category: "about otasora.website",
    content: `
     <div class="text-wrapper"> 
     <p>
     自分のサイトで<a href="https://ja.wikipedia.org/wiki/%E3%83%96%E3%83%AD%E3%82%B0" target="_blank">ブログ</a>をはじめてみようと思い、このページを作ってみた。
     </p>
     <p>
     文章を書くことは苦手だけれど、適当な言葉を書くことは好きだ。<br>
     しかし、ここではなるべく真面目な文章を書くようにしたい。知らない人も読むだろうし、まれにこのサイトから私に仕事をくれる人もいるかもしれないので、適当な人間だと思われたくない。とにかく、そういう練習をしていくことにした。
     </p>
     <p>
     今回はこのwebサイトについて覚書程度に書いていく。
     </p>
     </div>
     <hr class="blog-hr2">
     <div class="text-wrapper"> 
     <h1>
     〰このwebサイトについて〰
     </h1>
     <h2>
     構造について
     </h2>
     <p>
     このwebサイトの構造については明確に参考にしているものがいくつかある。
     </p>
     <p>
     2025年2月に<a href="https://www.designhub.jp/" target="_blank">東京ミッドタウン・デザインハブ</a>で行われた<a href="https://www.designhub.jp/exhibitions/dm2025" target="_blank">「もうひとつの表示」</a>という展示の「文字とイメージを分けない表現方法の研究（<a href="https://ryojitanaka.com/" target="_blank">田中良治</a> × 谷口暁彦 × 佐クマサトシ）」という作品のwebページを参考にしている。トークイベントの際にこのサイトのドメインを見つけたけれど、どこかに行ってしまった。悲しい。
     </p>
     <p>
     この作品は画面が三つに分断されていて、左端のエリアに歌人の<a href="https://sayusha.com/authors/-/sakuma-satoshi" target="_blank">佐クマサトシ</a>さんの短歌が縦向きにスクロールできる状態で表示されている。短歌の中の単語や言葉に関連する<a href="https://okikata.org/" target="_blank">谷口暁彦</a>さんの作品ページや外部ページの<a href="https://ja.wikipedia.org/wiki/%E3%83%8F%E3%82%A4%E3%83%91%E3%83%BC%E3%83%AA%E3%83%B3%E3%82%AF" target="_blank">ハイパーリンク</a>が貼られていて、クリックすると中央のエリアにそのページが表示されるようになっている。他のリンクを押すと再度中央に表示されて、その前の表示ページは右端のエリアに流れていく。そんな感じだったはずだ。
     </p>
     <p>
     このwebサイトを展示会場でみた時に、サイト内に履歴としてその連なりが残るという仕組みに面白さを感じ、この仕組みを何かで使いたいと思っていた。<br>
私のサイトでは下のバーで表示したページの履歴が残るようになっている。履歴を残すことで、自分がどのページをみたかを確認できるし、再度そのページへのショートカットとしても機能している。ページの多いサイトでこの機能は便利だと思う。
     </p>
     <p>
     それとあからさまに<a href="https://ja.wikipedia.org/wiki/Finder" target="_blank">Finder</a>の表示も参考にしている。つまり、webサイトのファイルの階層構造を開けっぴらに見せる形になっている。右に行くたびに階層が深くなるように表示される。<br>
しかし、実際にはこのサイトはページごとにフォルダに別れた階層構造になっているわけではなく、<a href="https://developer.mozilla.org/ja/docs/Web/JavaScript" target="_blank">JavaScript</a>でクリックのイベントごとに動的にコンテンツを表示する仕組みになっている。なので少しねじれがある。この方法にしたのは履歴を表示するためにページを遷移できないからだ。（もしかしたらできるかもしれないが、わからなかった。）そして、このねじれはユーザーには関係ない。
     </p>
     <p>
     階層構造をサイトのデザインで明示することの利点を整理したい。
     </p>
     <p>
     ⭐︎ページ数の多いwebサイトでは階層を行ったり来たりしながら見ることはとても、本当にめんどくさい！
     </p>
     <p>
     階層を行ったり来たりしながらページをみないといけない場合、二、三ページみたら満足してしまうし、遷移するたびにローディングが遅かったりするとかなりストレスを感じてしまう。こういった作品の記録を載せてページ数が膨らむ前提のサイトはなるべく遷移を少なくしたい。
     </p>
     <p>
     ⭐︎パソコンで見る場合には横に長すぎる
     </p>
     <p>
     どのくらいの人がパソコンでwebサイトをみるのか分からないが、パソコンでwebサイト表示する場合横に長いという感覚が常々あった。これはスマホに慣れていることやポスターなどの印刷物も一般的に流通しているものは縦長が多いからだと思う。横長の画面は縦に伸びるサイトの表記に対して要素の表示のバランスが難しいと思う。<br><br>
例えば、作品の画像を載せる際に左詰めか中央に配置して、画面に対してなるべく大きく載せると画像の全体を一度に見ることはできないことが多い。かといって画面の縦幅に合わせた大きさにすると画面内のバランスを取ることが難しくなる。<br>
単に私のデザインの力不足な気もしてきたが、そういうことを考えている時に画面を階層ごとに割ることで少しでも縦長にできないかと思いをめぐらせた。そこで最初に紹介した「文字とイメージを分けない表現方法の研究」の三つの画面に割る構成を参考にしてみた。
     </p>
     <p>
     画面を分割し階層ごとのページを常に表示することで、遷移の回数を減らし、尚且つパソコン表示での横長のバランスの悪さをごまかすことができたと思う。
     </p>
     <p>
     スマホでは結局エリアごとに表示しているので、階層の行ったり来たり問題がある。スマホは画面が小さいので表示できる情報に限界があるので仕方ないかも知れない。何か思いついたら改造していきたい。
     </p>
     <h2>
     <br>見た目について
     </h2>
     <p>
     構造についてはこんな感じで、見た目については私の癖そのままで作ってしまった感じが拭えない。その癖と意識したところを少しまとめる。
     </p>
     <h2>
     my 癖(クセ)
     </h2>
     <p>
     webサイトを作る時に本来はカンプを作ってからそれに沿ってコーディングをしていくのがエラーなく楽な方法だと思う。けれど、私の場合はコードを書きながらデザインを組んでいくので、元になるラフとか<a href="https://www.jfpi.or.jp/webyogo/index.php?term=612" target="_blank">カンプ</a>とかが全く存在しない。これでは大きな仕事とかはできないだろうなと常々思っている。個人サイトならではの作り方だという見方もできる。<br>
ありきたりな例えになるが、この作り方は粘土をこねているみたい。しかし<a href="https://www.adobe.com/jp/products/illustrator.html" target="_blank">イラレ</a>や3Dソフトのように視覚的な直感としてこねているというよりも数値でこねている感覚がある。この感覚をもっと言葉にしていきたいと思っている。
     </p>
     <p>
     私のこの作り方の場合、ページ内で要素の分離が起こりがちで、一枚のグラフィックというよりも<a href="https://tetris.com/" target="_blank">テトリス</a>のようなブロック状の要素が積み重なって表示されているような見た目になってしまう。例えば、要素に<a href="https://developer.mozilla.org/ja/docs/Web/CSS/border" target="_blank">border</a>を指定して、要素の範囲を表示していることで、平面的になり空間を生まない。<br>
それは退屈さもありながら、私にとっては画面をタイル状に埋めていくような作業としてのデザインを意識させる。私の癖なのかも知れないが、イラレで何かを作る時の感覚と違って、徹底してこの方法で作ってしまう。これがいいのか悪いのかわからない。けれど、私は私の作ったwebサイトが好きなので、この方法でもっと発展させていきたい。

     </p>
     <h2>
     backgroundのドット表現
     </h2>
     <p>
     このサイトではエリアや要素ごとの<a href="https://developer.mozilla.org/ja/docs/Web/CSS/background" target="_blank">backgroundに</a>ドットの画像を用いている。それぞれ3×3ピクセルで模様を作り反復して表示している。例えばこんな感じ↓
     </p>
     </div>

     <img src="blog/aboutThisSite/1-1.png" />
     <div class="text-wrapper">
     <p>
     そのドットの密度で色の濃淡がベースの色との組み合わせで各所の色に展開している。
これは「<a href="https://otasora.website/hakko/" target="_blank">発光！</a>」という別のサイトを作った時にドット単位で画面の色をコントロールしたら面白いかなというアイデアで今回やってみた。<a href="https://ja.wikipedia.org/wiki/%E3%82%AB%E3%83%A9%E3%83%BC%E3%82%B3%E3%83%BC%E3%83%89" target="_blank">カラーコード</a>でベタに色をつけるよりも変な質感になってよかったなと思う。
     </p>
      <h2>
     実装について
     </h2>
     <p>
     全て<a href="https://chatgpt.com/ja-JP/overview?openaicom_referred=true" target="_blank">ChatGPT</a>に聞きながらやった。ほとんど書いてもらったのが現実。<br>
私がコードについて知っていることは<a href="https://detail.chiebukuro.yahoo.co.jp/qa/question_detail/q14226221839" target="_blank">ミジンコ</a>ほどもないので、これまでは分からない所とかうまくいかないところは友人に聞くか、調べて<a href="https://ja.wikipedia.org/wiki/%E3%82%B3%E3%83%94%E3%83%BC%E3%83%BB%E3%82%A2%E3%83%B3%E3%83%89%E3%83%BB%E3%83%9A%E3%83%BC%E3%82%B9%E3%83%88" target="_blank">コピペ</a>していたので、より一層部屋で一人で黙々とできてしまうのは身体に悪いような気がする。友人たちは迷惑が減ったので安心しているでしょう？
    </p>
    <p>
    調べてコピペはChatGPTとほとんど変わらないと思う。キーワードか会話形式かという点で私はかなり楽になった。本当はこのコードを作った人がいるが、ChatGPTが自分で作ったように偉ぶっていることもあるだろうと時々思う。<br><br>
カンプも作らず自分でコーディングもしない場合、具体的にどうしたいかを言葉にするのが難しく、うまくいかないこともたくさんあるが、しつこく質問を重ねることでなんとか形になった気がする。JavaScriptの理解は永遠にできそうにない。これから微妙に作り直すときに行き詰まる未来があることでしょう。<br>
ChatGPTは今では質問の最後に偉そうに「完全なコードを生成しましょうか？」と聞いてくる。それに「どうぞお願いします。」と答えて作っていただいております。
</p>

 </div>
     <hr class="blog-hr1">
     <div class="text-wrapper"> 
     <h2>
     簡単なまとめ
     </h2>
     <p>
     <a href="http://www.yosikawaya.co.jp/" target="_blank">http://www.yosikawaya.co.jp/
     </a><br>
     こういった昔作ったままにされている会社のwebサイトや個人で作ったwebサイトが好きなので、見た目もこういうのを無意識に参考にしてしまう。<a href="https://ja.wikipedia.org/wiki/Favicon" target="_blank">ファビコン</a>が地球だ！
     </p>
     <p>
構造と見た目は作り方に由来していると今回書いてみて思った。書いては<a href="https://web-seisaku-kaisha.com/it-yougo-jiten/it-moji-hyouji/pc-kinou-sousa/riro-do.html" target="_blank">リロード</a>、修正してはリロードを心を込めて毎回行う度にこのサイトの血肉になっているように思う。
あくまでも個人サイトなので、この方法で<a href="https://detail.chiebukuro.yahoo.co.jp/qa/question_detail/q13256056383" target="_blank">しこしこ</a>と続けていきたい。
</p>
     <p>
     こういう感じでつらつらとこのサイトについて書いてみた。作っている時はここまで考えているわけではないので、書きながら整理？して記述した。私は日頃からwebサイトを大量にみて詳しいというわけではないので、<a href="https://detail.chiebukuro.yahoo.co.jp/qa/question_detail/q1427984439" target="_blank">頓珍漢</a>で、もしかしたら古い感じがするかも知れない。勉強しながら自由に続けていきたい。作品を単に載せるだけのサイトではなく、改造や増築を繰り返して違法建築の城のような面構えを目指す。
     </p>
     <p>このサイトを<a href="https://ja.wikipedia.org/wiki/%E3%83%96%E3%83%83%E3%82%AF%E3%83%9E%E3%83%BC%E3%82%AF" target="_blank">ブックマーク</a>などして、時々みにきてもらえると嬉しいです。よろしくお願いします。⭐︎三</p>
     </div>

      <br>

    `
  }
//   ,
//   {
//     pagetitle: "blog-002",
//     title: "二つ目の記事",
//     date: "2025-08-30",
//     category: "技術",
//     content:  `
//      <div class="text-wrapper"> <p>自分のサイトでブログをはじめてみようと思い、このページを作ってみた。</p>
//      <p>文章を書くことは苦手だけれど、適当な文章を書くことは好きだ。
//         <br>
//         ここではなるべく真面目な文章を書くようにしたい。知らない人も読むだろうし、まれにこのサイトから私に仕事をくれる人もいるかもしれないので、適当な人間だと思われたくない。とにかく、そういう練習をしていくことにした。
//         <br><br>
//         今回はこのwebサイトについて覚書程度に書いていく。
//      </p>
//      <h1>このwebサイトについて</h1>
//      <h2>構造について</h2>
//      <p>このwebサイトの構造を参考にしているものがいくつかある。</p>
//      <p>2025年2月に東京ミッドタウン・デザインハブで行われた「もうひとつの表示」という展示の「文字とイメージを分けない表現方法の研究」という作品のwebページを参考にしている。トークイベントの際にこのサイトのドメインを見つけたけれど、どこかに行ってしまった。悲しい。</p>
//      <p>この作品は画面が三つに分断されていて、左端のエリアに歌人の佐クマサトシさんの短歌が縦向きにスクロールできる状態で表示されている。短歌の中の単語や言葉に関連する谷口暁彦さんの作品ページや外部ページのハイパーリンクが貼られていて、クリックすると中央のエリアにそのページが表示されるようになっている。他のリンクを押すと再度中央に表示されて、その前の表示ページは右端のエリアに流れていく。そんな感じだったはずだ。</p>
//      <p>このwebサイトを展示会場でみた時に、サイト内に履歴としてその連なりが残るという仕組みに面白さを感じて、この仕組みを何かで使いたいと思っていた。私のサイトでは下のバーで表示したページの履歴が残るようになっている。履歴を残すことで、自分がどのページをみたかを確認できるし、再度そのページへのショートカットとしても機能している。ページの多いサイトでこの機能は便利だと思う。</p>
//      <p>それとあからさまにFinderの表示も参考にしている。つまり、webサイトのファイルの階層構造を開けっぴらに見せる形になっている。右に行くたびに階層が深くなるように表示される。
//         しかし、実際にはこのサイトはページごとにフォルダに別れた階層構造になっているわけではなく、クリックのイベントごとに生成される動的なサイトになっている。なので少しねじれがある。動的なサイトにしたのは履歴を表示するためにページを遷移できないからだ。（もしかしたらできるかもしれないが、わからなかった。）そして、このねじれはユーザーには関係ない。
     

//     `
//   }
];


